Repository: microsoft/XamlBehaviors
Catalog: src/BehaviorsSDKManaged/Microsoft.Xaml.Interactions/MultilingualResources/Microsoft.Xaml.Interactions.*.xlf
Languages: fr_fr

# CallMethodActionValidMethodNotFoundExceptionMessage
source: Cannot find method named {0} on object of type {1} that matches the expected signature.
fr_fr: Impossible de trouver la méthode nommée {0} sur l'objet de type {1} qui correspond à la signature attendue.

# CannotAttachBehaviorMultipleTimesExceptionMessage
source: An instance of a behavior cannot be attached to more than one object at a time.
fr_fr: Une instance de Behavior ne peut pas être attachée à plus d'un objet à la fois.

# CannotFindEventNameExceptionMessage
source: Cannot find an event named {0} on type {1}.
fr_fr: Impossible de trouver un événement nommé {0} sur le type {1}.

# ChangePropertyActionCannotFindPropertyNameExceptionMessage
source: Cannot find a property named {0} on type {1}.
fr_fr: Impossible de trouver une propriété nommée {0} sur le type {1}.

# ChangePropertyActionCannotSetValueExceptionMessage
source: Cannot assign value of type {0} to property {1} of type {2}. The {1} property can be assigned only values of type {2}.
fr_fr: Impossible d'attribuer une valeur de type {0} à la propriété {1} de type {2}. Seules des valeurs de type {2} peuvent être attribuées à la propriété {1}.

# ChangePropertyActionPropertyIsReadOnlyExceptionMessage
source: Property {0} defined by type {1} does not expose a set method and therefore cannot be modified.
fr_fr: La propriété {0} définie par le type {1} n'expose pas une méthode set et ne peut, par conséquent, pas être modifiée.

# EventNotSupportedExceptionMessage
source: Event {0} is not supported. Consider implementing a custom IBehavior to respond to this event.
fr_fr: L'événement {0} n'est pas pris en charge. Si possible, implémentez un type iBehavior personnalisé pour répondre à cet événement.

# GoToStateActionTargetHasNoStateGroups
source: Target {0} does not define any VisualStateGroups.
fr_fr: La cible {0} ne définit pas de VisualStateGroups.

# InvalidLeftOperand
source: Binding property of type {0} cannot be used with operator {1}.
fr_fr: La propriété de liaison de type {0} ne peut pas être utilisée avec l'opérateur {1}.

# InvalidOperands
source: Binding property of type {0} and Value property of type {1} cannot be used with operator {2}.
fr_fr: La propriété de liaison de {0} la propriété de valeur de type {1} ne peuvent pas être utilisées avec l'opérateur {2}.

# InvalidRightOperand
source: Value property of type {0} cannot be used with operator {1}.
fr_fr: La propriété de valeur de type {0} ne peut pas être utilisée avec l'opérateur {1}.
