Repository: microsoft/XamlBehaviors
Catalog: src/BehaviorsSDKNative/Microsoft.Xaml.Interactions/MultilingualResources/Microsoft.Xaml.Interactions.*.xlf
Languages: ru_ru

# CallMethodActionValidMethodNotFoundExceptionMessage
source: Cannot find method named {0} on object of type {1} that matches the expected signature.
ru_ru: Невозможно найти метод с именем {0} в объекте типа {1}, который соответствовал бы ожидаемой подписи.

# CannotAttachBehaviorMultipleTimesExceptionMessage
source: An instance of a behavior cannot be attached to more than one object at a time.
ru_ru: Невозможно прикрепить экземпляр поведения к нескольким объектам одновременно.

# CannotFindEventNameExceptionMessage
source: Cannot find an event named {0} on type {1}.
ru_ru: Невозможно найти событие с именем {0} в типе {1}.

# ChangePropertyActionCannotFindPropertyNameExceptionMessage
source: Cannot find a property named {0} on type {1}.
ru_ru: Невозможно найти свойство с именем {0} в типе {1}.

# ChangePropertyActionCannotSetValueExceptionMessage
source: Cannot assign value of type {0} to property {1} of type {2}. The {1} property can be assigned only values of type {2}.
ru_ru: Невозможно назначить значение типа {0} свойству {1} типа {2}. Свойству {1} можно назначить только значения типа {2}.

# ChangePropertyActionPropertyIsReadOnlyExceptionMessage
source: Property {0} defined by type {1} does not expose a set method and therefore cannot be modified.
ru_ru: Свойство {0}, определяемое типом {1}, не предоставляет заданный метод и, следовательно, не может быть изменено.

# EventNotSupportedExceptionMessage
source: Event {0} is not supported. Consider implementing a custom IBehavior to respond to this event.
ru_ru: Событие {0} не поддерживается. Для отклика на данное событие рекомендуется реализовать пользовательское поведение IBehavior.

# GoToStateActionTargetHasNoStateGroups
source: Target {0} does not define any VisualStateGroups.
ru_ru: Целевой объект {0} не определяет никаких групп VisualStateGroups.

# InvalidLeftOperand
source: Binding property of type {0} cannot be used with operator {1}.
ru_ru: Свойство привязки типа {0} невозможно использовать с оператором {1}.

# InvalidOperands
source: Binding property of type {0} and Value property of type {1} cannot be used with operator {2}.
ru_ru: Свойство привязки типа {0} и свойство значения типа {1} невозможно использовать с оператором {2}.

# InvalidRightOperand
source: Value property of type {0} cannot be used with operator {1}.
ru_ru: Свойство значения типа {0} невозможно использовать с оператором {1}.
